// Создать массив на 10 элементов, Заполнить его целыми числами, Вывести элементы на экран

int n = 10;
int[] arr = new int[n];
int i = 0;

// while (i < n)
while (i < arr.)
{
    arr[i] = i + 1;
    // coconsole.Write(arr[i]);
    // console.Write(arr[' ']);
    Console.Write($"{arr[i]} ");
    i = i + 1;
    
}
