// Создать целочисленный массив на 10 элементов и заполнить его произвольными числами.
// Вывести на экран чётные элементы массива.

Console.WriteLine("Hello, World!");
